Dlubal.SteelSurfaces.CURVE_TYPE
Type of the curve

Dlubal.SteelSurfaces.CURVE_TYPE.CT_UNKNOWN
Unknown curve type

Dlubal.SteelSurfaces.CURVE_TYPE.CT_LINE
Line

Dlubal.SteelSurfaces.CURVE_TYPE.CT_ARC
Arc

Dlubal.SteelSurfaces.CURVE_TYPE.CT_CIRCLE
Circle